# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]



list1 = [2, 3, 4, 5, 6, 7, 8, 9, 23, 5, 63, 123, 34, 5, 1, 2, 54, 7]

def func(list1):
    res = []
    while len(list1) > 1:
        res.append(list1[0]*list1[-1])
        del list1[0] 
        del list1[-1] 
    if len(list1) ==1: 
        res.append(list1[0]**2)       
    return res

x = list(func(list1))

print(x)